#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-07a43b2f08fcc8274]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0cc877ccb08ef6827]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_internet_gateway_attachment.igw-attachment: Refreshing state... [id=igw-07a43b2f08fcc8274:vpc-0cc877ccb08ef6827]
module.vpc.aws_subnet.public-subnets[0]: Refreshing state... [id=subnet-0ca704b23eb21659e]
module.vpc.aws_subnet.public-subnets[1]: Refreshing state... [id=subnet-016c8589e07a513ec]
module.vpc.aws_subnet.private-subnets[0]: Refreshing state... [id=subnet-0795d4b2fb322ed3a]
module.vpc.aws_subnet.private-subnets[1]: Refreshing state... [id=subnet-0a3490ddccad196e2]
aws_security_group.sg-host: Refreshing state... [id=sg-0a7dbef9b4e5824ab]
module.vpc.aws_route_table.rt-pub: Refreshing state... [id=rtb-06f8471e54e011d3b]
module.instance.aws_instance.instance: Refreshing state... [id=i-0a310ceca73d0552d]
module.instance-client.aws_instance.instance: Refreshing state... [id=i-051302ac03eab5933]
module.vpc.aws_route_table_association.rt-association-pub[0]: Refreshing state... [id=rtbassoc-0caa14a1b09331f2f]
module.vpc.aws_route_table_association.rt-association-pub[1]: Refreshing state... [id=rtbassoc-046ded2f88f572c04]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_sns_topic.devops-sns will be created
  + resource "aws_sns_topic" "devops-sns" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "poc-template-sns-dev"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "CreatedAt" = "2023-12-12"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Rogerio Calixto"
          + "Project"   = "Terraform RPC setup"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.futura-sns-email will be created
  + resource "aws_sns_topic_subscription" "futura-sns-email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "calixto.futura@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.instance-client.aws_instance.instance will be updated in-place
  ~ resource "aws_instance" "instance" {
        id                                   = "i-051302ac03eab5933"
      ~ instance_type                        = "t3.small" -> "t3.micro"
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "poc-template-client"
            "Project"     = "poc-template"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```
</details>
*Pushed by: @rogerio-calixto, Action: `pull_request`*